Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: However, all tabs that come after a non-blank character are kept.
es_es: Sin embargo, se respetan todos los tabulados a continuación de un carácter no vacío.

source: If you want these to be converted as well, add a !: >
es_es: Añada «!» si desea convertir éstos también: >

source: This is a little bit dangerous, because it can also change tabs inside a string.
es_es: Esto es algo peligroso, ya que también puede cambiar los tabulados dentro de una cadena.

source: To check if these exist, you could use this: >
es_es: Puede usar lo siguiente para comprobar la existencia de éstos: >

source: It's recommended not to use hard tabs inside a string.
es_es: Se recomienda no usar tabulados rígidos dentro de una cadena.

# Replace them with " " to avoid trouble.
source: Replace them with "\t" to avoid trouble.
es_es: Reemplácelos con «\t» para evitar problemas.

source: One of the great things about Vim is that it understands comments.
es_es: Una de las mayores virtudes de Vim es que entiende comentarios.

source: You can ask Vim to format a comment and it will do the right thing.
es_es: Puede pedir a Vim que dé formato a un comentario, y hará lo correcto.

source: Suppose, for example, that you have the following comment:
es_es: Suponga que tiene el siguiente comentario:

source: /* ~ * This is a test ~ * of the text formatting.
es_es: /* ~ * Esta es una prueba ~ * de formateo de texto.

source: "gq" is the operator to format text.
es_es: «gq» es el operador para formatear texto.

source: "]/" is the motion that takes you to the end of a comment.
es_es: «]/» es el movimiento que le lleva al final del comentario.

source: Notice that Vim properly handled the beginning of each line.
es_es: Observe que Vim manipuló adecuadamente el principio de cada línea.

source: An alternative is to select the text that is to be formatted in Visual mode and type "gq".
es_es: Una alternativa es seleccionar el texto a formatear en modo Visual, y teclear «gq».

source: To add a new line to the comment, position the cursor on the middle line and press "o".
es_es: Para añadir una nueva línea al comentario, posicione el cursor en la línea central y pulse «o».

source: Vim has automatically inserted a star and a space for you.
es_es: Vim ha insertado un «*» y un espacio automáticamente.

source: Now you can type the comment text.
es_es: Ahora puede escribir el texto de comentario.

source: When it gets longer than 'textwidth', Vim will break the line.
es_es: Si la línea excede el valor de 'textwidth', Vim romperá la línea.

source: Again, the star is inserted automatically:
es_es: Una vez más, se inserta «*» automáticamente.

source: ~ * Typing a lot of text here will make Vim ~ * break ~ */ ~
es_es: ~ * Teclear mucho texto hará que Vim divida ~ * la línea ~ */ ~

source: The 'comments' option defines what a comment looks like.
es_es: La opción 'comments' define el aspecto de un comentario.

source: Vim distinguishes between a single-line comment and a comment that has a different start, end and middle part.
es_es: Vim distingue entre un comentario de una sola línea y un comentario cuyo principio, parte central y final son distintas.

source: Many single-line comments start with a specific character.
es_es: Muchos comentarios de una sola línea empiezan con carácter específico.

source: In C++ // is used, in Makefiles #, in Vim scripts ".
es_es: En C++ se usa «//», «#» en archivos «Makefile», y «"» en scripts de Vim.

source: For example, to make Vim understand C++ comments: >
es_es: Por ejemplo, para que Vim entienda comentarios en C++: >

source: The colon separates the flags of an item from the text by which the comment is recognized.
es_es: Los dos puntos separan las opciones de un elemento del texto por el cual se reconoce un comentario.

source: The general form of an item in 'comments' is:
es_es: La forma habitual de un elemento en 'comments' es:

source: There are two items, one for comments starting with ">" and one for comments that start with "!".
es_es: Hay dos elementos, uno para los comentarios que empiezan con «>» y otro para los comentarios que comienzan con «!».

source: Both use the flag "n".
es_es: Ambos usan la opción «n».

source: This means that these comments nest.
es_es: Esto significa que estos comentarios se anidan.

source: Thus a line starting with ">" may have another comment after the ">".
es_es: Por lo tanto, una línea comenzando con «>» puede tener otro comentario después de «>».

source: This allows formatting a message like this:
es_es: Esto permite dar formato a un mensaje como este:

source: The ~ > colors are terrible.
es_es: Los ~ > colores son horribles.

source: ~ What is the URL of that ~ site?
es_es: ~ ¿Cual es la URL de esa ~ página web?

source: Try setting 'textwidth' to a different value, e.g., 80, and format the text by Visually selecting it and typing "gq".
es_es: Pruebe configurando 'textwidth' con un valor diferente, de 80, y formatee el texto seleccionándolo en modo Visual y escribiendo «gq».

source: The colors are terrible.
es_es: Los colores son horribles.

source: ~ What is the URL of that site?
es_es: ~ ¿Cual es la URL de esa página web?

source: You will notice that Vim did not move text from one type of comment to another.
es_es: Notará que Vim no desplazó el texto de un tipo de comentario a otro.

source: The "I" in the second line would have fit at the end of the first line, but since that line starts with "> !" and the second line with ">", Vim knows that this is a different kind of comment.
es_es: El «No» en la segunda línea puede encajar al final de la primera línea, pero ya que la línea comienza con «> !», y la segunda con «>», Vim detectará que es otro tipo de comentario.

source: A C comment starts with "/*", has "*" in the middle and "*/" at the end.
es_es: Un comentario de C empieza con «/*», «*» en el medio, y «/*» al final.

source: The entry in 'comments' for this looks like this: >
es_es: La entrada en 'comments' tendría este aspecto: >

source: The start is defined with "s1:/*".
es_es: El principio se define con «s1:/*».

source: The "s" indicates the start of a three-piece comment.
es_es: La «s» indica el principio de un comentario en tres partes.

source: The colon separates the flags from the text by which the comment is recognized: "/*".
es_es: Los dos puntos separan las marcas del texto por el cual se detecta que es un comentario: «/*».

source: There is one flag: "1".
es_es: Hay una marca, «1».

source: This tells Vim that the middle part has an offset of one space.
es_es: Indica a Vim que la parte central tiene un «offset» de un espacio.

source: The middle part "mb:*" starts with "m", which indicates it is a middle part.
es_es: La parte central «mb:*» comienza con «m», que indica que es la parte central.

source: The "b" flag means that a blank must follow the text.
es_es: La opción «b» indica que el texto debe ir seguido de un espacio en blanco.

source: Otherwise Vim would consider text like "*pointer" also to be the middle of a comment.
es_es: En caso contrario, Vim considerará que el texto como «*pointer» también es la parte central de un comentario.

source: The end part "ex:*/" has the "e" for identification.
es_es: La parte final «ex:*/» tiene «e» como identificador.

source: The "x" flag has a special meaning.
es_es: La opción «x» tiene un significado especial.

source: It means that after Vim automatically inserted a star, typing / will remove the extra space.
es_es: Indica que pulsar «/» eliminará el espacio adicional después de que Vim haya insertado automáticamente un asterisco, «*».

source: *usr_28.txt* For Vim version 7.3.
es_es: *usr_28.esx* Para Vim versión 7.3.

source: |28.1| What is folding?
es_es: |28.1| ¿Qué es plegar?

source: |28.2| Manual folding |28.3| Working with folds |28.4| Saving and restoring folds |28.5| Folding by indent |28.6| Folding with markers |28.7| Folding by syntax |28.8| Folding by expression |28.9| Folding unchanged lines |28.10| Which fold method to use?
es_es: |28.2| Plegar manualmente |28.3| Trabajar con pliegues |28.4| Guardar y restaurar pliegues |28.5| Plegar por sangrado |28.6| Plegar con marcadores |28.7| Plegar por sintaxis |28.8| Plegar por expresión |28.9| Plegar líneas sin cambios |28.10¿| ¿Qué método de plegar debería usar?

source: Folding is used to show a range of lines in the buffer as a single line on the screen.
es_es: Plegar se usa para mostrar un rango de líneas en un búfer como una sola línea en la pantalla.

source: Like a piece of paper which is folded to make it shorter:
es_es: Como un trozo de papel plegado para acortarlo.

source: The text is still in the buffer, unchanged.
es_es: El texto aún está en el búfer, sin cambios.

source: Only the way lines are displayed is affected by folding.
es_es: Plegar sólo afecta a la manera en que se muestran las líneas.

source: You will see that the paragraph is replaced by a highlighted line.
es_es: Verá que una línea resaltada reemplaza al párrafo.

source: You have created a fold.
es_es: Ha creado un pliegue.

source: |zf| is an operator and |ap| a text object selection.
es_es: |zf| es un operando y |ap| una selección de un objeto textual.

source: You can use the |zf| operator with any movement command to create a fold for the text that it moved over.
es_es: Puede usar el operando |zf| con cualquier orden de desplazamiento para crear un pliegue para el texto reemplazado.

source: |zf| also works in Visual mode.
es_es: |zf| funciona también en el modo Visual.

source: All the folding commands start with "z".
es_es: Todas las órdenes de plegado empiezan con «z».

source: With some fantasy, this looks like a folded piece of paper, seen from the side.
es_es: Si usa la imaginación, se asemeja a un papel plegado visto de lado.

source: The letter after the "z" has a mnemonic meaning to make it easier to remember the commands:
es_es: La letra a continuación de «z» tiene un significado nemónico que facilita recordar las órdenes:

source: Suppose you have created several folds, and now want to view all the text.
es_es: Imagine que ha creado varios pliegues, y que ahora desea ver todo el texto.

source: You could go to each fold and type "zo".
es_es: Puede ir a cada pliegue y teclear «zo».

source: To do this faster, use this command: >
es_es: Use la siguiente orden para hacer esto mismo con rapidez: >

source: This will R-educe the folding.
es_es: Esto r_educe el plegado.

source: The opposite is: >
es_es: Lo opuesto es: >

source: This folds M-ore.
es_es: Esto pliega m_ás.

source: You can repeat "zr" and "zm" to open and close nested folds of several levels.
es_es: Puede repetir «zr» y «zm» para abrir y cerrar pliegues anidados en varios niveles.

source: You can quickly disable the folding with the |zn| command.
es_es: Puede desactivar el plegado rápidamente con la orden |zn|.

source: Then |zN| brings back the folding as it was.
es_es: |Zn| devuelve el plegado a su estado previo.

source: |zi| toggles between the two.
es_es: |zi| pasa de uno a otro.

source: This is a useful way of working: - create folds to get overview on your file - move around to where you want to do your work - do |zi| to look at the text and edit it - do |zi| again to go back to moving around
es_es: Esta es una buena forma de trabajar: creación de pliegues para obtener una visión general de su archivo - desplazarse a las áreas que desea modificar - visionado y edición del texto con |zi| - repita |zi| para seguir desplazándose.

source: When some folds are closed, movement commands like "j" and "k" move over a fold like it was a single, empty line.
es_es: De haber algunos pliegues cerrados, las órdenes de movimiento como «j» y «k» se desplazarán sobre el pliegue como si fuese una única línea vacía.

source: This allows you to quickly move around over folded text.
es_es: Esto permite un desplazamiento más rápido sobre texto plegado.

source: It is sometimes difficult to see or remember where a fold is located, thus where a |zo| command would actually work.
es_es: A veces es difícil ver o recordar la ubicación de un pliegue; la orden |zo| es de utilidad en estos caso.

source: To see the defined folds: >
es_es: Para ver los pliegues definidos: >

source: This will show a small column on the left of the window to indicate folds.
es_es: Esto muestra una pequeña columna a la izquierda de la ventana que indica los pliegues.

source: A "+" is shown for a closed fold.
es_es: Un «+» simboliza un pliegue cerrado.

source: A "-" is shown at the start of each open fold and "|" at following lines of the fold.
es_es: Un «-» aparece al principio de cada pliegue abierto y «|» simboliza líneas del pliegue a continuación.

source: You can use the mouse to open a fold by clicking on the "+" in the foldcolumn.
es_es: Puede usar el ratón para abrir un pliegue pulsando sobre la «+» en la columna de plegado.

source: Clicking on the "-" or a "|" below it will close an open fold.
es_es: Pulsar sobre «-» o el «|» que aparece debajo cierra un pliegue abierto.

source: To open all folds at the cursor line use |zO|.
es_es: Use |zO| para abrir todos los pliegues en la línea del cursor.

source: To close all folds at the cursor line use |zC|.
es_es: Use |zC| para cerrar todos los pliegues en la línea del cursor.

source: To delete a fold at the cursor line use |zd|.
es_es: Puede eliminar un pliegue en la línea del cursor con |zd|.

source: To delete all folds at the cursor line use |zD|.
es_es: Use |zD| para borrar todos los pliegues bajo la línea del cursor.

source: When in Insert mode, the fold at the cursor line is never closed.
es_es: La línea del cursor nunca se cierra en el modo Insertar.

source: That allows you to see what you type!
es_es: Esto permite ver lo que teclea.

source: Folds are opened automatically when jumping around or moving the cursor left or right.
es_es: Los pliegues se abren automáticamente al desplazarse o moviendo el cursor a la izquierda o a la derecha.

source: For example, the "0" command opens the fold under the cursor (if 'foldopen' contains "hor", which is the default).
es_es: Por ejemplo, la orden «0» abre el pliegue bajo el cursor (si 'foldopen' contiene 'hor', el valor predeterminado).

source: The 'foldopen' option can be changed to open folds for specific commands.
es_es: Puede modificar la opción 'foldopen' para abrir los pliegues con órdenes específicas.

source: If you want the line under the cursor always to be open, do this: >
es_es: Haga lo siguiente si desea que la línea bajo el cursor esté siempre abierta: >

source: Warning: You won't be able to move onto a closed fold then.
es_es: Aviso: en esta situación, no será capaz de desplazarse a un pliegue cerrado.

source: You might want to use this only temporarily and then set it back to the default: >
es_es: Puede que desea usar esto temporalmente para después devolverlo al valor original: >

source: This will re-apply 'foldlevel' to all folds that don't contain the cursor.
es_es: Esto ejecutará 'foldlevel' en todos los pliegues que no contengan el cursor.

source: You have to try it out if you like how this feels.
es_es: Tiene que probar para ver si le gusta.

source: Use |zm| to fold more and |zr| to fold less (reduce folds).
es_es: Use |zm| para plegar más, y |zr| para plegar menos (reducir los pliegues).

source: The folding is local to the window.
es_es: El pliegue es local para la ventana.

source: This allows you to open two windows on the same buffer, one with folds and one without folds.
es_es: Esto permite abrir dos ventanas en el mismo búfer, uno con pliegues y otro sin ellos.

source: Or one with all folds closed and one with all folds open.
es_es: O uno con todos los pliegues cerrados y otro con todos los pliegues abiertos.

source: When you abandon a file (starting to edit another one), the state of the folds is lost.
es_es: Al cerrar un archivo para iniciar la edición de otro, el estado del pliegue es eliminado.

source: If you come back to the same file later, all manually opened and closed folds are back to their default.
es_es: Si vuelve al mismo archivo más tarde, todos aquellos pliegues cerrados y abiertos manualmente volverán a su estado predeterminado.

source: When folds have been created manually, all folds are gone!
es_es: ¡Perderá todos los pliegues creados manualmente.

source: To save the folds use the |:mkview| command: >
es_es: Use la orden |:mkview| para guardar el estado de los archivos: >

source: This will store the settings and other things that influence the view on the file.
es_es: Esto guardará la configuración y otras que cosas que modifican el visionado del archivo.

source: You can change what is stored with the 'viewoptions' option.
es_es: Puede modificar lo guardado con la opción 'viewoptions'.

source: When you come back to the same file later, you can load the view again: >
es_es: Puede cargar el mismo visionado al volver al archivo más tarde: >

source: You can store up to ten views on one file.
es_es: Puede guardar hasta diez visionados distintos de un archivo.

source: For example, to save the current setup as the third view and load the second view: >
es_es: Por ejemplo, para guardar la configuración actual como el tercer visionado, y cargar después el segundo: >

source: Note that when you insert or delete lines the views might become invalid.
es_es: Tenga en cuenta que, al insertar o eliminar líneas, las vistas dejarán de ser válidas.

source: Also check out the 'viewdir' option, which specifies where the views are stored.
es_es: Revise también la opción 'viewdir', que define donde se guardan los visionados.

source: You might want to delete old views now and then.
es_es: Puede que desee eliminar viejos visionados de vez en cuando.

source: Defining folds with |zf| is a lot of work.
es_es: Definir pliegues con |zf| supone mucho trabajo.

source: If your text is structured by giving lower level items a larger indent, you can use the indent folding method.
es_es: Si el texto está estructurado de forma que los elementos de un nivel inferior tienen un mayor sangrado, puede usar el método de pliegue por sangrado.

source: This will create folds for every sequence of lines with the same indent.
es_es: Ésto crea pliegues para cada secuencia de líneas dentro del mismo sangrado.

source: Lines with a larger indent will become nested folds.
es_es: Las líneas con un sangrado mayor se convertirán en pliegues anidados.

source: This works well with many programming languages.
es_es: Esto funciona muy bien con varios lenguajes de programación.

source: Then you can use the |zm| and |zr| commands to fold more and reduce folding.
es_es: Puede después usar las órdenes |zm| y |zr| para aumentar y reducir el plegado.

source: It's easy to see on this example text:
es_es: Es fácil de ver con este texto de ejemplo:

source: Note that the relation between the amount of indent and the fold depth depends on the 'shiftwidth' option.
es_es: Tenga en cuenta que la relación entre la cantidad de sangrado y la profundidad del pliegue depende de la opción 'shiftwidth'.

source: Each 'shiftwidth' worth of indent adds one to the depth of the fold.
es_es: Cada 'shiftwidth' con el valor de un sangrado añade uno a la profundidad del pliegue.

source: This is called a fold level.
es_es: Este se denomina nivel de plegado.

source: When you use the |zr| and |zm| commands you actually increase or decrease the 'foldlevel' option.
es_es: En realidad, cuando usa las órdenes |zr| y |zm| aumento o disminuye la opción 'foldlevel'.

source: You could also set it directly: >
es_es: Puede también definirlo directamente: >

source: This means that all folds with three times a 'shiftwidth' indent or more will be closed.
es_es: Esto significa que todos los pliegues con un sangrado tres veces el valor de 'shiftwidth' se cerrarán.

source: The lower the foldlevel, the more folds will be closed.
es_es: Cuanto más bajo es 'foldlevel', más pliegues se cerrarán.

source: When 'foldlevel' is zero, all folds are closed.
es_es: Si el valor de 'foldlevel' es cero, se cerrarán todos los pliegues.

source: |zM| does set 'foldlevel' to zero.
es_es: |zM| define 'foldlevel' como cero.

source: The opposite command |zR| sets 'foldlevel' to the deepest fold level that is present in the file.
es_es: La orden opuesta |zR| define 'foldlevel' con el valor de nivel de pliegue más bajo presente en el archivo.

source: Thus there are two ways to open and close the folds: (A) By setting the fold level.
es_es: Por ello, hay dos maneras de abrir y cerrar los pliegues: (a) Definiendo el nivel de pliegue (foldlevel).

source: This gives a very quick way of "zooming out" to view the structure of the text, move the cursor, and "zoom in" on the text again.
es_es: Esto ofrece un rápida manera de alejar la vista para ver la estructura general del texto, desplazar el cursor, acercar la vista y de vuelta al texto otra vez.

source: (B) By using |zo| and |zc| commands to open or close specific folds.
es_es: (B) Usando las órdenes |zo| y |zc| para abrir o cerrar pliegues específicos.

source: This allows opening only those folds that you want to be open, while other folds remain closed.
es_es: Esto permite abrir sólo aquellos pliegues que desea abrir, manteniendo los otros cerrados.

source: This can be combined: You can first close most folds by using |zm| a few times and then open a specific fold with |zo|.
es_es: Esto se puede combinar: primero puede cerrar la mayoría de los pliegues usando |zm| unas cuantas veces, y después abrir un pliegue en particular con |zo|.

source: Or open all folds with |zR| and then close specific folds with |zc|.
es_es: O abrir todos los pliegues con |zR| y después cerrar pliegues específicos con |zc|.

source: Notice that the folded line will display the text before the marker.
es_es: Observe que la líena plegada mostrará el texto previo al marcador.

source: This is very useful to tell what the fold contains.
es_es: Es útil para informar de los contenidos del pliegue.

source: It's quite annoying when the markers don't pair up correctly after moving some lines around.
es_es: Es bastante molesto cuando los marcadores no encajan correctamente tras desplazar algunas líneas.

source: This can be avoided by using numbered markers.
es_es: Esto se puede evitar usando marcadores numerados.

source: At every numbered marker a fold at the specified level begins.
es_es: Un pliegue se iniciará con el nivel definido por cada marcador numerado.

source: This will make any fold at a higher level stop here.
es_es: Esto detiene en este punto cualquier pliegue de nivel superior.

source: You can just use numbered start markers to define all folds.
es_es: Puede usar marcadores de inicio numerados para definir todos los pliegues.

source: Only when you want to explicitly stop a fold before another starts you need to add an end marker.
es_es: Tendrá que añadir un marcador de fin sólo cuando desee detener un pliegue antes de iniciar otro.

source: This is similar to folding by indent, but instead of using the indent of a line a user function is called to compute the fold level of a line.
es_es: Es similar a plegar por sangrado pero usa una función de usuario para computar el nivel de pliegue de una línea, en lugar del sangrado.

source: You can use this for text where something in the text indicates which lines belong together.
es_es: Puede usar esto con texto en el que éste indica qué líneas están juntas.

source: An example is an e-mail message where the quoted text is indicated by a ">" before the line.
es_es: Un ejemplo es un correo electrónico en el que el texto citado se indica con un «>» al inicio de la línea.

source: To fold these quotes use this: >
es_es: Use esto para plegar esas citas: >
